CSI API ETABS v1

# cSapModelEditPoint Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cEditPoint EditPoint { get; }

    ReadOnly Property EditPoint As cEditPoint
    	Get

    Dim instance As cSapModel
    Dim value As cEditPoint

    value = instance.EditPoint

    property cEditPoint^ EditPoint {
    	cEditPoint^ get ();
    }

    abstract EditPoint : cEditPoint with get

#### Property Value

Type: cEditPoint

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com